first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 38], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artwork_shares"."viewer_id" = $1 AND "artworks"."artist_id" != $2  [["viewer_id", "39"], ["artist_id", 39]]
---
    def index
        @rtworks = Artwork.where(artist_id: params[:user_id])

        @rtworks += Artwork.joins(:shares)
                            .where(artwork_shares: {viewer_id: params[:user_id]})
                            .where.not(artist_id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def show
        @rtwork = Artwork.find_by(id: params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "doesnt exist"], ["image_url", "/app/assets/images/deadpool.jpg"], ["artist_id", 13], ["created_at", "2020-08-13 14:26:11.595181"], ["updated_at", "2020-08-13 14:26:11.595181"]]
---
    def create
        @rtwork = Artwork.new(artwork_params)

        if @rtwork.save