first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 24], ["viewer_id", 41], ["created_at", "2020-08-13 15:36:49.397906"], ["updated_at", "2020-08-13 15:36:49.397906"]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)

        if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 38]]
---
    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        @artwork_share.destroy