first_routes_and_controllers/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            @comments = User.find(params[:user_id]).comments
        elsif params.has_key?(:artwork_id)
            @comments = Artwork.find(params[:artwork_id]).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 58]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 41]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

    def create
        @comment = Comment.new(comment_params)
        @comment.artwork_id = params[:id]
        # debugger
        if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "i eat couches!"], ["user_id", 61], ["artwork_id", 41], ["created_at", "2020-08-13 19:12:46.165790"], ["updated_at", "2020-08-13 19:12:46.165790"]]

    def destroy
        @comment = Comment.find(params[:id])
        art_id = @comment.artwork_id
        @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]