first_routes_and_controllers/app/controllers/likes_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "likes" ("liker_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["liker_id", 68], ["comment_id", 19], ["created_at", "2020-08-13 21:31:52.924420"], ["updated_at", "2020-08-13 21:31:52.924420"]]
---
    def create
        @like = Like.new(like_params)
        if params.has_key?(:comment_id)
            @like.comment_id = params[:comment_id]
            redirect_id = Comment.find(params[:comment_id]).artwork.id
        elsif params.has_key?(:artwork_id)
            @like.artwork_id = params[:artwork_id]
            redirect_id = params[:artwork_id]
        end

        if @like.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."artwork_id" = $1  [["artwork_id", 51]]
---
    def index
        if params.has_key?(:user_id)
            @likes = User.find(params[:user_id]).likes
        elsif params.has_key?(:artwork_id)
            @likes = Artwork.find(params[:artwork_id]).likes