first_routes_and_controllers/app/controllers/users_controller.rb

    def create
        # render json: params
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "John"], ["email", "john@email.com"], ["created_at", "2020-08-12 19:07:43.675235"], ["updated_at", "2020-08-12 19:07:43.675235"]]