first_routes_and_controllers/app/controllers/users_controller.rb

    def index
        # check if any params
            #if there are params, then we look for username key
                #if username key present, find_by username
                    #if result !nil return the user
        #return user.all

        if params.has_key?(:username)
            @users = User.where("users.username iLIKE ?", "%#{params[:username]}%")
            if @users.nil?
                @users = User.all
            end
        else
            @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Kane"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (users.username LIKE '%Brendon%')

    def create
        # render json: params
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rich"], ["email", "soontobe@rich.com"], ["created_at", "2020-08-12 19:33:49.214254"], ["updated_at", "2020-08-12 19:33:49.214254"]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "santa@southpole.com"], ["updated_at", "2020-08-12 19:27:25.774377"], ["id", 4]]